app/controllers/test_controller.rb

INSERT INTO `users` (`email`, `password`, `number_phone`, `created_at`, `updated_at`) VALUES ('a@gmail.com', '12345', 9876543, '2020-08-17 15:05:25.037163', '2020-08-17 15:05:25.037163')
---
    def sign_up
        user = User.new(set_user)
        if user.save!

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'hahahahaha@gmail.com' LIMIT 1
---
    def post_sign_in
        user= User.new(data_sign_in)
        user1=User.find_by(email: user.email)